src/Reports/ОтчетПоОтпускам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетПоОтпускам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныОтсутствияНаРаботеВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормированияОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакФормированияОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьВидыОтпусков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныОтсутствияНаРаботеВОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/ОтпускаФактическиеПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтпускаФактическиеПоСотрудникам</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныОтсутствияНаРаботеВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыОтзываИзОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОтзываИзОтпуска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компенсация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ОтчетПоОтпускам/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда 
	
	
	Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокПоОтпускам, ДокументРезультат)
		//мНомер = 0;
		Пока ВыборкаСтрокПоОтпускам.Следующий() Цикл 
			
			ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокПоОтпускам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокПоОтпускам.ПодразделениеОрганизации Тогда	
				
				//ПСА 14.09.2021 СВФР-008122 +++
				Если Организация.ИНН <> "700067572" Тогда
					//ПСА 13.09.2021 СВФР-008122 +++
					Если ПризнакФормированияОтчета = 3 Тогда
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1Период");
					Иначе
						//+++ПСА 13.09.2021 СВФР-008122
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
					КонецЕсли;
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокПоОтпускам.ПодразделениеОрганизации.Код);
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокПоОтпускам.ПодразделениеОрганизации.Наименование;				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				КонецЕсли;
			    //+++ПСА 14.09.2021 СВФР-008122

				мНомер = мНомер + 1;
				//ПСА 13.09.2021 СВФР-008122 +++
				Если ПризнакФормированияОтчета = 3 Тогда
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("СтрокаПериод");
				Иначе	
				//+++ПСА 13.09.2021 СВФР-008122
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
				КонецЕсли;
				ОбластьДетальныхЗаписей.Параметры.мНомер = мНомер;
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокПоОтпускам.Сотрудник.Код;	
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокПоОтпускам.Сотрудник.Наименование;
				ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокПоОтпускам.Должность;
				//ПСА 13.09.2021 СВФР-008122 +++
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииРодитель = ВыборкаСтрокПоОтпускам.ПодразделениеОрганизацииРодитель; 
				Если ПризнакФормированияОтчета = 3 Тогда
					ДниЗаПериодНачало = НачалоДня(Макс(ВыборкаСтрокПоОтпускам.НачалоОтпуска,НачПериод));
					ДниЗаПериодКонец  = НачалоДня(Мин(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска,КонПериод));
					Если ДниЗаПериодНачало = ДниЗаПериодКонец Тогда
						ДниЗаПериод = 1;
					Иначе
						ДниЗаПериод = (ДниЗаПериодКонец - ДниЗаПериодНачало)/(60*60*24) + 1;
					КонецЕсли;	
					ОбластьДетальныхЗаписей.Параметры.ДниЗаПериод = ДниЗаПериод;
				КонецЕсли;
				//+++ПСА 13.09.2021 СВФР-008122
				Попытка
					ОбластьДетальныхЗаписей.Параметры.Номер = СокрЛП(ВыборкаСтрокПоОтпускам.Регистратор.НомерПриказа);
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокПоОтпускам.Регистратор.ДатаПриказа;
					ОбластьДетальныхЗаписей.Параметры.Дни = ВыборкаСтрокПоОтпускам.КоличествоДней;
				Исключение
					ОбластьДетальныхЗаписей.Параметры.Номер = СокрЛП(ВыборкаСтрокПоОтпускам.Регистратор.НомерПриказаОбОкончанииОтпускаПл);
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокПоОтпускам.Регистратор.ДатаПриказаОбОкончанииОтпускаПл;
					ОбластьДетальныхЗаписей.Параметры.Дни = (ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска-ВыборкаСтрокПоОтпускам.НачалоОтпуска)/86400;
				КонецПопытки;
				ОбластьДетальныхЗаписей.Параметры.ВидОтпуска = ВыборкаСтрокПоОтпускам.Состояние;
				ОбластьДетальныхЗаписей.Параметры.Начало = ВыборкаСтрокПоОтпускам.НачалоОтпуска;
				ОбластьДетальныхЗаписей.Параметры.Окончание = ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска;			
				//(начало) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
				ОбластьДетальныхЗаписей.Параметры.Примечание = ?( ЗначениеЗаполнено( ВыборкаСтрокПоОтпускам.ОтзывДата ), 
				"Отзыв из отпуска, приказ № " + ВыборкаСтрокПоОтпускам.ОтзывНомерПриказа
				+ " от " + Формат( ВыборкаСтрокПоОтпускам.ОтзывДата, "ДЛФ=Д" ), "" );			
				//(конец ) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
				//Аверсон 06.09.2021 КВВ СВФР-008048 (
				ВыводитьСтроку = Истина;
				Если ЗначениеЗаполнено(ВыборкаСтрокПоОтпускам.ОтзывДок) Тогда
					Если ВыборкаСтрокПоОтпускам.ОтзывДок.ОтражатьИзмененияПоПродлению 
						И ВыборкаСтрокПоОтпускам.ОтзывДок.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Продление
						И ЗначениеЗаполнено(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС) Тогда
						Если ЗначениеЗаполнено(ВыборкаСтрокПоОтпускам.НачалоОтпуска) Тогда
							Если НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ДатаНачала)-1) 
								ИЛИ НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеПо)  Тогда
								
								Если НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеПо) Тогда
									Если НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС) <> НачалоДня(ВыборкаСтрокПоОтпускам.НачалоОтпуска) Тогда
										ОбластьДетальныхЗаписей.Параметры.Начало = НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС);
										ОбластьДетальныхЗаписей.Параметры.Дни = ((ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска-НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС))/86400)+1;
									КонецЕсли;
								КонецЕсли;
								
							Иначе
								ВыводитьСтроку = Ложь;
							КонецЕсли;
						Иначе
							ВыводитьСтроку = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ВыводитьСтроку Тогда
					//Аверсон 06.09.2021 КВВ СВФР-008048 )
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					ТекПодр = ВыборкаСтрокПоОтпускам.ПодразделениеОрганизации;
				КонецЕсли;
			Иначе
				
				мНомер = мНомер + 1;
				//ПСА 13.09.2021 СВФР-008122 +++
				Если ПризнакФормированияОтчета = 3 Тогда
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("СтрокаПериод");
				Иначе	
				//+++ПСА 13.09.2021 СВФР-008122
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
				КонецЕсли;
				ОбластьДетальныхЗаписей.Параметры.мНомер = мНомер;
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокПоОтпускам.Сотрудник.Код;	
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокПоОтпускам.Сотрудник.Наименование;
				ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокПоОтпускам.Должность;
				//ПСА 13.09.2021 СВФР-008122 +++
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииРодитель = ВыборкаСтрокПоОтпускам.ПодразделениеОрганизацииРодитель; 
				Если ПризнакФормированияОтчета = 3 Тогда
					ДниЗаПериодНачало = НачалоДня(Макс(ВыборкаСтрокПоОтпускам.НачалоОтпуска,НачПериод));
					ДниЗаПериодКонец  = НачалоДня(Мин(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска,КонПериод));
					Если ДниЗаПериодНачало = ДниЗаПериодКонец Тогда
						ДниЗаПериод = 1;
					Иначе
						ДниЗаПериод = (ДниЗаПериодКонец - ДниЗаПериодНачало)/(60*60*24) + 1;
					КонецЕсли;	
					ОбластьДетальныхЗаписей.Параметры.ДниЗаПериод = ДниЗаПериод;
				КонецЕсли;
				//+++ПСА 13.09.2021 СВФР-008122
				Попытка
					ОбластьДетальныхЗаписей.Параметры.Номер = СокрЛП(ВыборкаСтрокПоОтпускам.Регистратор.НомерПриказа);
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокПоОтпускам.Регистратор.ДатаПриказа;
					ОбластьДетальныхЗаписей.Параметры.Дни = ВыборкаСтрокПоОтпускам.КоличествоДней;
				Исключение
					ОбластьДетальныхЗаписей.Параметры.Номер = СокрЛП(ВыборкаСтрокПоОтпускам.Регистратор.НомерПриказаОбОкончанииОтпускаПл);
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокПоОтпускам.Регистратор.ДатаПриказаОбОкончанииОтпускаПл;
					ОбластьДетальныхЗаписей.Параметры.Дни = (ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска-ВыборкаСтрокПоОтпускам.НачалоОтпуска)/86400;
				КонецПопытки;
				ОбластьДетальныхЗаписей.Параметры.ВидОтпуска = ВыборкаСтрокПоОтпускам.Состояние;
				ОбластьДетальныхЗаписей.Параметры.Начало = ВыборкаСтрокПоОтпускам.НачалоОтпуска;
				ОбластьДетальныхЗаписей.Параметры.Окончание = ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска;			
				//(начало) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
				ОбластьДетальныхЗаписей.Параметры.Примечание = ?( ЗначениеЗаполнено( ВыборкаСтрокПоОтпускам.ОтзывДата ), 
				"Отзыв из отпуска, приказ № " + ВыборкаСтрокПоОтпускам.ОтзывНомерПриказа
				+ " от " + Формат( ВыборкаСтрокПоОтпускам.ОтзывДата, "ДЛФ=Д" ), "" );			
				//(конец ) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
				//Аверсон 06.09.2021 КВВ СВФР-008048 (
				ВыводитьСтроку = Истина;
				Если ЗначениеЗаполнено(ВыборкаСтрокПоОтпускам.ОтзывДок) Тогда
					Если ВыборкаСтрокПоОтпускам.ОтзывДок.ОтражатьИзмененияПоПродлению 
						И ВыборкаСтрокПоОтпускам.ОтзывДок.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Продление
						И ЗначениеЗаполнено(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС) Тогда
						Если ЗначениеЗаполнено(ВыборкаСтрокПоОтпускам.НачалоОтпуска) Тогда
							Если НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ДатаНачала)-1) 
								ИЛИ НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеПо)  
								
								//Аверсон 10.01.2023 КВВ СВФР-010133 (
								ИЛИ 
								(НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС)-1) 
								И НачалоДня(ВыборкаСтрокПоОтпускам.НачалоОтпуска) > НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ДатаОкончания))
								//Аверсон 10.01.2023 КВВ СВФР-010133 )
								
								Тогда
								
								Если НачалоДня(ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска) = НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеПо) Тогда
									Если НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС) <> НачалоДня(ВыборкаСтрокПоОтпускам.НачалоОтпуска) Тогда
										ОбластьДетальныхЗаписей.Параметры.Начало = НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС);
										ОбластьДетальныхЗаписей.Параметры.Дни = ((ВыборкаСтрокПоОтпускам.ОкончаниеОтпуска-НачалоДня(ВыборкаСтрокПоОтпускам.ОтзывДок.ПродлениеС))/86400)+1;
									КонецЕсли;
								КонецЕсли;
								
							Иначе
								ВыводитьСтроку = Ложь;
							КонецЕсли;
						Иначе
							ВыводитьСтроку = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ВыводитьСтроку Тогда
					//Аверсон 06.09.2021 КВВ СВФР-008048 )
					
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					ТекПодр = ВыборкаСтрокПоОтпускам.ПодразделениеОрганизации;
				КонецЕсли;
			КонецЕсли;
			ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
			
		КонецЦикла;//цикл по подразделениям текущего уровня 	
	КонецПроцедуры
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
	//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
	//                      табличного документа)
	//
	Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
		
		ТекПодр = "";
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "
		//(начало) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   Истина КАК НачальныйПериодОтпуска,
		|   ОтпускаФакт.НачалоОтпуска КАК НачалоОтпуска,
		|   ОтпускаФакт.ОкончаниеОтпуска КАК ОкончаниеОтпуска,
		|	СостояниеРаботников.Сотрудник,
		|	Отзыв.Приказ КАК Приказ,
		|	Отзыв.НомерПриказа КАК ОтзывНомерПриказа,
		|	Отзыв.Дата КАК ОтзывДата,
		|	Отзыв.Ссылка КАК ОтзывДок, //Аверсон 06.09.2021 КВВ СВФР-008048
		|	НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( СостояниеРаботников.Период, ДЕНЬ, -1 ), ДЕНЬ ) КАК ОкончаниеНачальногоПериодаОпуска,
		|	НАЧАЛОПЕРИОДА( СостояниеРаботников.ПериодЗавершения, ДЕНЬ ) КАК НачалоКонечногоПериодаОтпуска
		|ПОМЕСТИТЬ ВтПериодыОтпускаБезВыходных
		|ИЗ
		|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФакт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|			ПО ОтпускаФакт.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботников
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтзывИзОтпуска КАК Отзыв
		|					ПО СостояниеРаботников.Регистратор = Отзыв.Ссылка
		|				  	И СостояниеРаботников.Организация = &Организация
		|				ПО 
		
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) (
		//|					ОтпускаФакт.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания
		|(НЕ ОтпускаФакт.НачалоОтпуска > &ДатаОкончания
		|ИЛИ НЕ ОтпускаФакт.ОкончаниеОтпуска < &ДатаНачала)
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) )
		
		|				   И ОтпускаФакт.Сотрудник = СостояниеРаботников.Сотрудник
		|				   И СостояниеРаботников.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
		|				   И ОтпускаФакт.Регистратор = Отзыв.Приказ
		|ГДЕ
		
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) (
		//|					ОтпускаФакт.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания
		|(НЕ ОтпускаФакт.НачалоОтпуска > &ДатаОкончания
		|ИЛИ НЕ ОтпускаФакт.ОкончаниеОтпуска < &ДатаНачала)
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) )

		|	И СостояниеРаботников.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
		|	И СостояниеРаботников.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   Ложь КАК НачальныйПериодОтпуска,
		|   ОтпускаФакт.НачалоОтпуска КАК НачалоОтпуска,
		|   ОтпускаФакт.ОкончаниеОтпуска КАК ОкончаниеОтпуска,
		|	СостояниеРаботников.Сотрудник,
		|	Отзыв.Приказ КАК Приказ,
		|	Отзыв.НомерПриказа КАК ОтзывНомерПриказа,
		|	Отзыв.Дата КАК ОтзывДата,
		|	Отзыв.Ссылка КАК ОтзывДок, //Аверсон 06.09.2021 КВВ СВФР-008048
		|	НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( СостояниеРаботников.Период, ДЕНЬ, -1 ), ДЕНЬ ) КАК ОкончаниеНачальногоПериодаОпуска,
		|	НАЧАЛОПЕРИОДА( СостояниеРаботников.ПериодЗавершения, ДЕНЬ ) КАК НачалоКонечногоПериодаОтпуска
		|ИЗ
		|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФакт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|			ПО ОтпускаФакт.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботников
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтзывИзОтпуска КАК Отзыв
		|					ПО СостояниеРаботников.Регистратор = Отзыв.Ссылка
		|				  		И СостояниеРаботников.Организация = &Организация
		|				ПО 
		
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) (
		//|					ОтпускаФакт.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания
		|(НЕ ОтпускаФакт.НачалоОтпуска > &ДатаОкончания
		|ИЛИ НЕ ОтпускаФакт.ОкончаниеОтпуска < &ДатаНачала)
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) )

		|				   И ОтпускаФакт.Сотрудник = СостояниеРаботников.Сотрудник
		|				   И СостояниеРаботников.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
		|				   И ОтпускаФакт.Регистратор = Отзыв.Приказ
		|ГДЕ
		
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) (
		//|					ОтпускаФакт.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания
		|(НЕ ОтпускаФакт.НачалоОтпуска > &ДатаОкончания
		|ИЛИ НЕ ОтпускаФакт.ОкончаниеОтпуска < &ДатаНачала)
		//Аверсон 05.01.2023 КВВ СВФР-010109 (пункт 2) )

		|	И СостояниеРаботников.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
		|	И СостояниеРаботников.Организация = &Организация
		|;
		|
		|////////////////  2  ///////////////////////////
		|ВЫБРАТЬ 
		|   ПериодыОтпуска.НачальныйПериодОтпуска,
		|   ПериодыОтпуска.НачалоОтпуска,
		|   ПериодыОтпуска.ОкончаниеОтпуска,
		|	ПериодыОтпуска.Сотрудник,
		|	ПериодыОтпуска.Приказ,
		|	ПериодыОтпуска.ОтзывНомерПриказа,
		|	ПериодыОтпуска.ОтзывДата,
		|	ПериодыОтпуска.ОтзывДок, //Аверсон 06.09.2021 КВВ СВФР-008048
		|	ПериодыОтпуска.ОкончаниеНачальногоПериодаОпуска,
		|	ПериодыОтпуска.НачалоКонечногоПериодаОтпуска,
		|   СУММА( ISNULL( Календарь.КалендарныеДни, 0 ) ) КАК КоличествоДнейПериодаОтпуска
		|ПОМЕСТИТЬ ВтПериодыОтпуска
		|
		|ИЗ
		|	ВтПериодыОтпускаБезВыходных КАК ПериодыОтпуска
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК Календарь
		|	 ПО ПериодыОтпуска.НачальныйПериодОтпуска И Календарь.ДатаКалендаря МЕЖДУ ПериодыОтпуска.НачалоОтпуска И ПериодыОтпуска.ОкончаниеНачальногоПериодаОпуска
		|	 	ИЛИ НЕ ПериодыОтпуска.НачальныйПериодОтпуска И Календарь.ДатаКалендаря МЕЖДУ ПериодыОтпуска.НачалоКонечногоПериодаОтпуска И ПериодыОтпуска.ОкончаниеОтпуска
		|
		|СГРУППИРОВАТЬ ПО 
		|   НачальныйПериодОтпуска,
		|   НачалоОтпуска,
		|   ОкончаниеОтпуска,
		|	Сотрудник,
		|	Приказ,
		|	ОтзывНомерПриказа,
		|	ОтзывДата,
		|	ОтзывДок, //Аверсон 06.09.2021 КВВ СВФР-008048
		|	ОкончаниеНачальногоПериодаОпуска,
		|	НачалоКонечногоПериодаОтпуска
		|ИМЕЮЩИЕ
		|	СУММА( ISNULL( Календарь.КалендарныеДни, 0 ) ) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник, Приказ
		|;
		|/////////////////// 3 ////////////////////////////
		//(конец ) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|
		|ВЫБРАТЬ
		|	ОтпускаФактическиеПоСотрудникам.Сотрудник,
		|	ОтпускаФактическиеПоСотрудникам.Организация,
		|	ОтпускаФактическиеПоСотрудникам.Состояние,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	ОтпускаФактическиеПоСотрудникам.Регистратор,
		//ПСА 13.09.2021 СВФР-008122 +++
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяССылка)
		|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяССылка)
		|					ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяССылка)
		|							ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяССылка)
		|									ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель
		|								ИНАЧЕ ВЫБОР
		|										КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяССылка)
		|											ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель.Родитель
		|										ИНАЧЕ ВЫБОР
		|												КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяССылка)
		|													ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель.Родитель.Родитель
		|												ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ПодразделениеОрганизацииРодитель,
		//+++ПСА 13.09.2021 СВФР-008122

		//(начало) закомментировано Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		//|	ОтпускаФактическиеПоСотрудникам.НачалоОтпуска,
		//|	ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска,
		//|	ОтпускаФактическиеПоСотрудникам.КоличествоДней
		//(конец ) закомментировано Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		
		//(начало) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|	ПериодыОтпуска.ОтзывНомерПриказа КАК ОтзывНомерПриказа,
		|	ПериодыОтпуска.ОтзывДата КАК ОтзывДата,
		|	ПериодыОтпуска.ОтзывДок КАК ОтзывДок, //Аверсон 06.09.2021 КВВ СВФР-008048
		|	ВЫБОР КОГДА ПериодыОтпуска.НачальныйПериодОтпуска IS NULL ТОГДА ОтпускаФактическиеПоСотрудникам.НачалоОтпуска
		|   	ИНАЧЕ
		|		ВЫБОР 
		|			КОГДА ПериодыОтпуска.НачальныйПериодОтпуска ТОГДА 
		|       		ОтпускаФактическиеПоСотрудникам.НачалоОтпуска
		|			ИНАЧЕ 
		|           	ПериодыОтпуска.НачалоКонечногоПериодаОтпуска
		|		КОНЕЦ
		|	КОНЕЦ КАК НачалоОтпуска,
		|	ВЫБОР КОГДА ПериодыОтпуска.НачальныйПериодОтпуска IS NULL ТОГДА ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска
		|   	ИНАЧЕ
		|		ВЫБОР 
		|			КОГДА ПериодыОтпуска.НачальныйПериодОтпуска ТОГДА 
		|       		ПериодыОтпуска.ОкончаниеНачальногоПериодаОпуска
		|			ИНАЧЕ 
		|           	ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска
		|		КОНЕЦ
		|	КОНЕЦ КАК ОкончаниеОтпуска,
		|	ISNULL( ПериодыОтпуска.КоличествоДнейПериодаОтпуска, ОтпускаФактическиеПоСотрудникам.КоличествоДней ) КАК КоличествоДней
		//(конец ) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		
		|ИЗ
		|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ПО ОтпускаФактическиеПоСотрудникам.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		//(начало) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыОтпуска КАК ПериодыОтпуска
		|		ПО ОтпускаФактическиеПоСотрудникам.Сотрудник = ПериодыОтпуска.Сотрудник
		|			И ОтпускаФактическиеПоСотрудникам.Регистратор = ПериодыОтпуска.Приказ
		//(конец ) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	И ОтпускаФактическиеПоСотрудникам.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания
		//+ СВЭЙ КДЯ 17.10.19 СВФР-004935
		|	//И ОтпускаФактическиеПоСотрудникам.Состояние = &Состояние		
		//- СВЭЙ КДЯ 17.10.19 СВФР-004935
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаФактическиеПоСотрудникам.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	ОтпускаФактическиеПоСотрудникам.Сотрудник,
		|	ОтпускаФактическиеПоСотрудникам.Состояние,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	ОтпускаФактическиеПоСотрудникам.Регистратор,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет,
		//(начало) закомментировано Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		//|	ОтпускаФактическиеПоСотрудникам.НачалоОтпуска,
		//|	ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска,
		//|	ОтпускаФактическиеПоСотрудникам.КоличествоДней
		//(конец ) закомментировано Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		//(начало) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|	ПериодыОтпуска.ОтзывНомерПриказа,
		|	ПериодыОтпуска.ОтзывДата,
		|	ПериодыОтпуска.ОтзывДок, //Аверсон 06.09.2021 КВВ СВФР-008048
		|	ВЫБОР КОГДА ПериодыОтпуска.НачальныйПериодОтпуска IS NULL ТОГДА ОтпускаФактическиеПоСотрудникам.НачалоОтпуска
		|   	ИНАЧЕ
		|		ВЫБОР 
		|			КОГДА ПериодыОтпуска.НачальныйПериодОтпуска ТОГДА 
		|       		ОтпускаФактическиеПоСотрудникам.НачалоОтпуска
		|			ИНАЧЕ 
		|           	ПериодыОтпуска.НачалоКонечногоПериодаОтпуска
		|		КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР КОГДА ПериодыОтпуска.НачальныйПериодОтпуска IS NULL ТОГДА ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска
		|   	ИНАЧЕ
		|		ВЫБОР 
		|			КОГДА ПериодыОтпуска.НачальныйПериодОтпуска ТОГДА 
		|       		ПериодыОтпуска.ОкончаниеНачальногоПериодаОпуска
		|			ИНАЧЕ 
		|           	ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска
		|		КОНЕЦ
		|	КОНЕЦ,
		|	ISNULL( ПериодыОтпуска.КоличествоДнейПериодаОтпуска, ОтпускаФактическиеПоСотрудникам.КоличествоДней )
		//(конец ) добавлено Кухарчуком Д.Я. 18.07.18, Задача СВФР-002222
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизацииПриоритет";
		
		
		Запрос.УстановитьПараметр("Период",РабочаяДата);
		Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
		Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ЗначениеЗаполнено(ВидОтпуска) Тогда
			Запрос.УстановитьПараметр("Состояние",      ВидОтпуска);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОтпускаФактическиеПоСотрудникам.Состояние = &Состояние","И ОтпускаФактическиеПоСотрудникам.Состояние = &Состояние");
		Иначе
			Список = Новый СписокЗначений; 
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебный);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебныйНеоплачиваемый);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком);
			//Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.Компенсация);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоКоллДоговору);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоИнициативеНанимателя);
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоСостояниюЗдоровья);  
			Список.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускСамоизоляция);  

			
			Запрос.УстановитьПараметр("Состояние",      Список);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОтпускаФактическиеПоСотрудникам.Состояние = &Состояние","И ОтпускаФактическиеПоСотрудникам.Состояние В (&Состояние)");
		КонецЕсли;
		
		Если ПризнакФормированияОтчета = 2 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ОтпускаФактическиеПоСотрудникам.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания","И ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска МЕЖДУ &ДатаНачала и &ДатаОкончания");	
		//ПСА 13.09.2021 СВФР-008122 +++	
		ИначеЕсли ПризнакФормированияОтчета = 3 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ОтпускаФактическиеПоСотрудникам.НачалоОтпуска МЕЖДУ &ДатаНачала И &ДатаОкончания","И ОтпускаФактическиеПоСотрудникам.НачалоОтпуска <= &ДатаОкончания И ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска >= &ДатаНачала");				
		//+++ПСА 13.09.2021 СВФР-008122	
		КонецЕсли;
		
		Если СпособФормированияОтчета = 2 Тогда
			Список = Новый СписокЗначений;
			Для каждого НоваяСтр Из ТабличнаяЧастьВидыОтпусков Цикл
				Если ПустаяСтрока(НоваяСтр.ВидОтпуска) Тогда
					Продолжить;
				КонецЕсли;
				Список.Добавить(НоваяСтр.ВидОтпуска);
			КонецЦикла;
			Запрос.УстановитьПараметр("Состояние",      Список);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОтпускаФактическиеПоСотрудникам.Состояние = &Состояние","И ОтпускаФактическиеПоСотрудникам.Состояние В (&Состояние)");		
		КонецЕсли;
		
		Если Не Подразделение.Пустая() Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)");
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Результат = Запрос.Выполнить();
		
		ДокументРезультат.Очистить();
		
		Область = мМакет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Организация = Организация;	
		Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
		ДокументРезультат.Вывести(Область);
		
		//Параметры документа
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ДокументРезультат.АвтоМасштаб        = Истина;
		ДокументРезультат.ПолеСлева			 = 15;
		ДокументРезультат.ПолеСправа		 = 10;
		
		//ПСА 13.09.2021 СВФР-008122 +++
		Если ПризнакФормированияОтчета = 3 Тогда
			Область = мМакет.ПолучитьОбласть("ШапкаПериод");
		Иначе	
		//+++ПСА 13.09.2021 СВФР-008122
		Область = мМакет.ПолучитьОбласть("Шапка");
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		
		ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		мНомер = 0;
		ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
		
	КонецПроцедуры
	
	мМакет = ПолучитьМакет("МакетОтпусков");
	
#КонецЕсли
